package com.liaoshijie.tools.tinman.wechat_tool;

import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * @author liaoshijie@jojoreading.com
 * @since 2021/3/26 上午10:15
 */
public class RegexTest {

    public static final Pattern DOMAIAN_PATTERN = Pattern.compile("(https?.*?)(?=http|$|<|>|\\s|,)");

    /**
     * main method.
     **/
    public static void main(String[] args) {
        String txt = TXT;
        Matcher matcher = DOMAIAN_PATTERN.matcher(txt);
        List<String> domains = new ArrayList<>();
        while (matcher.find()) {
            domains.add(matcher.group());
            //System.out.println(matcher.group());
        }
        for (String domain : domains) {
            domain = domain.replaceAll("http://", "").replaceAll("https://", "");
            String[] arr1 = domain.split("\\/");
            //String[] arr2 = arr1[0].split("\\.");
            System.out.println(arr1[0]);
        }
    }

    private static final String TXT = "@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"     @所有人点击蓝色链接报今日领取课程的名单已经整理完毕，请家长们核对下马梓晴、张峻洋、彭天皓、王斌、刘佳、张强、刘文、沈航宇、石佳幸、赵若含、靳倩、刘子豪、张宇、刘悦、孔祥、万宥宥、朱蕾、煜泽、孟瑞欣、董一嘉、吴涵、小李、小张、 请家长核对一下以上信息是否正确，没有申请报名的将被踢出群聊 报名: 【入群报名任务 \" " +
            "+\n" +
            "                \"https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw   还没填写的家长请抓紧时间点击上方蓝色链接填写， 没有申请报名的将被踢出群聊。填写好的家长 请回复:  111\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \" 今日领取的名单已经整理完毕\\n\" +\n" +
            "                \"请家长们核对下：\\n\" +\n" +
            "                \"张瑶," +
            "王晔，高柳仙，李若琳，唐梓嘉，朱彦霏，丁家灿，伊昱豪，陈李，孙佳莹，杨雪，周思妤，赵琼，薛豆，刘欣彤，蒋元庆，余艺沿，耿雨涵，杨俊杰，刘程，代蕴涵，王润森，李玉婷，沈蕖璇，郑力文，王慧妍，田思怡，丁嘉琪，彭雅儇，杨博，王艺晰，兰欣林，曾子谦，袁宇熙，赵成媛，龚丽菲，陈子月，王佳勋，张淞泽，王小楠，邹广兴，何智杰，陈毅阳，李昊原，张锦成，芃芃，魏古鑫等部分学员的名单哦！名字更新较慢，稍后老师会更新的❗️\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方领取免费课程❗️❗️❗️\\n\" +\n" +
            "                \"【免费报名领资取\\u202C料】点击方下\\u202C链接\\n\" +\n" +
            "                \"【报名 入 口】：https://www.iandcode.com/wxldy/tfmarket/tfv2Tmp.html?cs=hn-hn001\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【听课 入 口】：https://www.iandcode.com/wxldy/tfmarket/tfv2Tmp.html?cs=hn-hn001\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【一定要报名才能听课】❗️❗️❗️\\n\" +\n" +
            "                \"请点击： https://www.iandcode.com/wxldy/tfmarket/tfv2Tmp.html?cs=hn-hn001\\n\" +\n" +
            "                \"——【报名成功回复“111”】❗️\\n\" +\n" +
            "                \"我是本群唯一班主任，保护好个人信息，认准我的报名链接❗️\\n\" +\n" +
            "                \"请把报名链接分享到其他学习群，可以领取学习资料\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"恭喜@魏古鑫同学报名成功\\n\" +\n" +
            "                \"今天的tv互动课是我们免费课程的最后一节了哦！还要继续学习的宝贝点击链接http://suo.im/5LkIKh可以48元再学10节哦\\n\" +\n" +
            "                \"\\uD83C\\uDF89\\uD83C\\uDF89\\uD83C\\uDF89欢迎加入学习群！\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"提分课程限时领取点击下方链接填写资料报名，为孩子领取免费体验课程！\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【入群报名任务】nkn1h59923ujxy40.mikecrm.com/y6gnhyR\\n\" +\n" +
            "                \"--------------------------------\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【入群报名任务】nkn1h59923ujxy40.mikecrm.com/y6gnhyR\\n\" +\n" +
            "                \"--------------------------------\\n\" +\n" +
            "                \"\\uD83C\\uDF89\\uD83C\\uDF89\\uD83C\\uDF89欢迎加入学习群！\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"提分课程限时领取点击下方链接填写资料报名，为孩子领取免费体验课程！\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【入群报名任务】nkn1h59923ujxy40.mikecrm.com/y6gnhyR\\n\" +\n" +
            "                \"--------------------------------\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【入群报名任务】nkn1h59923ujxy40.mikecrm.com/y6gnhyR\\n\" +\n" +
            "                \"--------------------------------\\n\" +\n" +
            "                \"报名家长只需点击链接报名即可！还没报名的家长将被移除！\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"提交成功后群里回复“1”[玫瑰]\\n\" +\n" +
            "                \"今天课程就结束啦！让我们看看继续学习S1的思维体验课会学到什么呢✨\\n\" +\n" +
            "                \"❤️主题：第一周神秘的光影+第二周AB规律感知\\n\" +\n" +
            "                \"\\uD83D\\uDC9B思维方法：对应思维、有序思维、逆向思维、抽象思维\\n\" +\n" +
            "                \"\\uD83D\\uDC99儿歌：每周各一首儿歌\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"现和一位好友组队学习，可享受拼团价48元哦～\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\uD83D\\uDC9C点击链接了解更多详情http://suo.im/5EfZmi\\n\" +\n" +
            "                \"赶快和班里小伙伴组团学习吧✌️\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"想报名2科的家长可以私信老师了解下英语S1体验课的学习内容，双科联报不需要拼团，立省20元\\uD83D\\uDCAA\\n\" +\n" +
            "                \"20节课仅需78元，戳\\uD83D\\uDC49http://suo.im/5xg3Cv\\n\" +\n" +
            "                \"     @所有人点击蓝色链接报今日领取课程的名单已经整理完毕，请家长们核对下马梓晴、张峻洋、彭天皓、王斌、刘佳、张强、刘文、沈航宇、石佳幸、赵若含、靳倩、刘子豪、张宇、刘悦、孔祥、万宥宥、朱蕾、煜泽、孟瑞欣、董一嘉、吴涵、小李、小张、 请家长核对一下以上信息是否正确，没有申请报名的将被踢出群聊 报名: 【入群报名任务 \" " +
            "+\n" +
            "                \"https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw   还没填写的家长请抓紧时间点击上方蓝色链接填写， 没有申请报名的将被踢出群聊。填写好的家长 请回复:  111\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/SyalhJU\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://suo.im/5Efwwo\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://suo.im/5Efwwo\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"     @所有人点击蓝色链接报今日领取课程的名单已经整理完毕，请家长们核对下马梓晴、张峻洋、彭天皓、王斌、刘佳、张强、刘文、沈航宇、石佳幸、赵若含、靳倩、刘子豪、张宇、刘悦、孔祥、万宥宥、朱蕾、煜泽、孟瑞欣、董一嘉、吴涵、小李、小张、 请家长核对一下以上信息是否正确，没有申请报名的将被踢出群聊 报名: 【入群报名任务 \" " +
            "+\n" +
            "                \"https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw   还没填写的家长请抓紧时间点击上方蓝色链接填写， 没有申请报名的将被踢出群聊。填写好的家长 请回复:  111\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、谢梦梦、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/c3QREVB\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5CDRL5\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、小象、张静、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、小象、张静、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"@所有人 家长们你们好\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取的名单已经整理完毕，请家长们核对下：\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"李梓琳，雷玉雯，黄子淳，蒋君豪，韦碧莹，王紫，高孰翔，王黎珺，梁家铭，芙罗拉，林子航，闫涵，包诗雨，蒋子谦，吕伟，郭怡珂，孙艺慧，朱铭律，白博翰，梁嘉丽，汤洁，高辰，何诺欣梓煜 ，徐晓晴，郭颜睿，马雨轩，周诗原，侯奥硕，梁鑫焱 \" +\n" +
            "                \"，孙果，王梓涵，徐嘉旎，李沭彤，小瑞，徐傲雪，周嘉怡，梁世权，王若溪，朱心悦，任彦铭，徐金奕，杨慧茹，吴雨涵，侯鑫楠，张兴华，刘长胜，马先瑞，李强盛，李锦绣，刘海岩，陈仁钧，胡添，刘悦如，姜乙山，檀林林，吴雨晨，梁宸，徐杭涛，刘子轩，张栋成，郑子扬，张益明，薛贝娜，陈妍菲，刘祖炎；袁嘉怡，黄楷哲，雨晴 ，吴奥雪，郭佳瑜， \" " +
            "+\n" +
            "                \"郑文涛，高梓翔，白隽语，杨熙珍，王世博，丁容懿，汤骏，刘天骐,张恒,李思璐 马悦涵 朱桂平 李梓瑶 卓熙 ，柴正川，周嘉骏，张洋，杜帅，陈俊文，彭佳波，李中伟，李浩阁，杨欣颖，韩钰琳，张舒然，珊珊，刘俊熙，张泽仑，罗可鑫，胡晨阳，葛苏明珠，李雨蒙，肖辰希，姜凯皓，郝若男，申宝,李柳,岑雪晶, 任芮萱 孙书瑶, 许思琪 , " +
            "Harry 张函菲 陈瑾睿 王雨乐 \" +\n" +
            "                \"韦诗一 蒋文昊 尤凌薇 侯奕辰 ，张冰冰，柴家鑫，吴俭，张紫琳，周翔，邢奕晴，张家濬 ，刘东，毛琰博，万国富，李思瑶，陈世瑞，汪博涵，陈陈，张萌，钱瀚文，浩然，武云朵，王欣怡，常诗语，李雨轩，李创，李浩苒，冯枳焱，王科人′， 等部分同学名单哦，名单持续更新中.......\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长核对一下以上信息是否正确，老师已经按照您申请的科目备课，\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方文字入口，为孩子申请报名\\n\" +\n" +
            "                \"报名入口：https://www.iandcode.com/weChatApi/pages/ldyv3?cs=shequnhlh-hlh03\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【否则会被移出群、取消学习资格】\\n\" +\n" +
            "                \"报名不用付费不用加好友.只需点击链.接报名即可-还没报名的家长将被移除.\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名入口：https://www.iandcode.com/weChatApi/pages/ldyv3?cs=shequnhlh-hlh03\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名入口：https://www.iandcode.com/weChatApi/pages/ldyv3?cs=shequnhlh-hlh03\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名入口：https://www.iandcode.com/weChatApi/pages/ldyv3?cs=shequnhlh-hlh03\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"【报名成功回复“111”】 12:00截止报名 孩子的名单会在12:00后公布 各位家长抓紧时间 ❗❗❗注意：【报名成功后会出现专属老师微信，请及时“添加老师微信”给您安排课程】❗❗❗未添加老师微信的一律视为无效报名！\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\\n\" +\n" +
            "                \"     @所有人点击蓝色链接报今日领取课程的名单已经整理完毕，请家长们核对下马梓晴、张峻洋、彭天皓、王斌、刘佳、张强、刘文、沈航宇、石佳幸、赵若含、靳倩、刘子豪、张宇、刘悦、孔祥、万宥宥、朱蕾、煜泽、孟瑞欣、董一嘉、吴涵、小李、小张、 请家长核对一下以上信息是否正确，没有申请报名的将被踢出群聊 报名: 【入群报名任务 \" " +
            "+\n" +
            "                \"https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw   还没填写的家长请抓紧时间点击上方蓝色链接填写， 没有申请报名的将被踢出群聊。填写好的家长 请回复:  111\\n\" +\n" +
            "                \"@所有人 \\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"今日领取名单已经整理完毕\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"请家长们核对下↓↓↓↓↓↓↓↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"吴杰辉、刘虹燕、陈震、王慧、郑洋洋、王佳豪、陈威、向敏、刘子杰、万宥宥、朱蕾、煜泽 、董小毵、董嘉伟、吴涵、谢孟辉、李婉茹、王萍、徐丹丹\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"名单上没有的家长请点下方↓ ↓\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"报名链接:https://nkn1h59923ujxy40.mikecrm.com/PAYHTaw\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"听课链接:http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"资料领取http://i7q.cn/5v7E4u\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名的家长请抓紧时间报名，报名成功的家长请回复“111”\\n\" +\n" +
            "                \"\\n\" +\n" +
            "                \"没报名视为放弃、并移除群聊！\" +\n" +
            "                \"www.baidu.com" +
            "https://jojoread.tinman.cn/web/notes/l2?classKey=21108_18&amp;lessonKey=30031_0006&amp;viewChannel=wechat&amp;channel=CDAPP_xiaomi_adr_xueyuanapp-&amp;shareKey=2dor3aXLoBYnIEx9\n" +
            "https://jojoread.yuque.com/docs/share/1ae4bc33-7337-42f1-9984-59dea5fe1cbb\n" +
            "";
}
